Revit 2027 API
BuiltInFailures.CreationFailures.CannotCreateReveal Property
 Could not create Reveal. [Description]
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotCreateReveal { get; }
Public Shared ReadOnly Property CannotCreateReveal As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotCreateReveal {
	FailureDefinitionId^ get ();
}
static member CannotCreateReveal : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CreationFailures Class
Autodesk.Revit.DB Namespace